---
kind: type
id: T:Autodesk.Revit.DB.ReferenceArrayArray
source: html/b50edc19-b437-2aab-bd03-5d1a0aed4164.htm
---
# Autodesk.Revit.DB.ReferenceArrayArray

An array that contains ReferenceArray objects.

## Syntax (C#)
```csharp
public class ReferenceArrayArray : APIObject,
	IEnumerable
```